slowpoke/synthetic/two-services/move-timer-read-microbenchmark/combined-poker10000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=300
SLOWPOKE_DELAY_MICROS_SERVICE0=200
SLOWPOKE_POKER_BATCH_THRESHOLD=10000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   306.61ms   40.66ms 554.69ms   83.76%
    Req/Sec   204.86     57.75   333.00     74.57%
  Latency Distribution
     50%  301.51ms
     75%  316.11ms
     90%  345.22ms
     99%  491.85ms
  4760 requests in 3.01s, 1.90MB read
Requests/sec:   1578.78
Transfer/sec:    646.01KB
[run.sh] Speed is 1578.78, duration is 38
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d38s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-5d59d695d6-x8j7s        627m         44Mi            
service1-5cdb57fdb5-vlm9l        906m         13Mi            
ubuntu-client-76886f6bbd-ldcc9   48m          10Mi            
Running 38s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   306.04ms   32.55ms 640.82ms   85.42%
    Req/Sec   209.45     52.78   656.00     72.87%
  Latency Distribution
     50%  305.46ms
     75%  318.70ms
     90%  335.71ms
     99%  384.26ms
  40000 requests in 38.00s, 15.98MB read
Requests/sec:   1052.63
Transfer/sec:    430.71KB
------------------------------
stop time: 23.733732
stop time: 23.741067
stop time: 23.955151
stop time: 24.102334
stop time: 24.188928
stop time: 24.197629
stop time: 24.190110
stop time: 24.270614
[run.sh] Test finished with status 0