slowpoke/synthetic/two-services/move-timer-read-microbenchmark/s1_no_rlock_d100-poker60000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=100
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=60000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   202.41ms   60.45ms 681.01ms   76.72%
    Req/Sec   307.70    108.65   530.00     59.92%
  Latency Distribution
     50%  196.09ms
     75%  218.21ms
     90%  260.53ms
     99%  443.80ms
  7308 requests in 3.03s, 2.92MB read
Requests/sec:   2415.13
Transfer/sec:      0.97MB
[run.sh] Speed is 2415.13, duration is 24
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d24s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 24s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   205.27ms   63.62ms 728.61ms   77.82%
    Req/Sec   311.72    110.28     1.18k    62.96%
  Latency Distribution
     50%  196.37ms
     75%  218.28ms
     90%  267.55ms
     99%  457.38ms
  40000 requests in 24.00s, 15.98MB read
Requests/sec:   1666.66
Transfer/sec:    681.96KB
------------------------------
stop time: 15.775121
stop time: 16.051713
stop time: 15.972603
stop time: 16.111920
stop time: 16.224981
stop time: 16.340606
stop time: 16.329886
stop time: 16.348708
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
ubuntu-client-76886f6bbd-6rdvb   28m          0Mi             
[run.sh] Test finished with status 0