slowpoke/synthetic/two-services/move-timer-read-microbenchmark/s1_no_rlockd_700-poker30000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=700
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=30000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   478.18ms  130.51ms   1.01s    77.50%
    Req/Sec   122.53     44.59   262.00     70.89%
  Latency Distribution
     50%  464.86ms
     75%  555.04ms
     90%  642.23ms
     99%  792.40ms
  2915 requests in 3.03s, 1.16MB read
Requests/sec:    962.96
Transfer/sec:    394.02KB
[run.sh] Speed is 962.96, duration is 62
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d62s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-8646cd44b-7g849         487m         45Mi            
service1-766484bd9f-l6j7v        607m         14Mi            
ubuntu-client-76886f6bbd-2cgd5   34m          13Mi            
Running 1m test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   507.12ms  127.14ms   1.40s    79.81%
    Req/Sec   125.94     45.20   440.00     68.58%
  Latency Distribution
     50%  463.84ms
     75%  566.11ms
     90%  695.52ms
     99%  869.81ms
  40000 requests in 1.03m, 15.98MB read
Requests/sec:    645.16
Transfer/sec:    263.99KB
------------------------------
stop time: 39.375826
stop time: 39.834467
stop time: 39.750007
stop time: 39.863682
stop time: 39.954053
stop time: 40.205319
stop time: 39.967491
stop time: 40.085611
[run.sh] Test finished with status 0