slowpoke/synthetic/two-services/move-timer-read-microbenchmark/s1_no_rlockd_700-poker40000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=700
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=40000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   484.97ms  154.01ms   1.22s    75.70%
    Req/Sec   121.05     54.95   270.00     67.65%
  Latency Distribution
     50%  449.58ms
     75%  567.25ms
     90%  714.98ms
     99%  902.12ms
  2884 requests in 3.03s, 1.15MB read
Requests/sec:    952.35
Transfer/sec:    389.68KB
[run.sh] Speed is 952.35, duration is 63
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d63s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-698fc84f47-l4tnp        482m         46Mi            
service1-6546b95774-wbfgf        609m         16Mi            
ubuntu-client-76886f6bbd-8pgwc   35m          14Mi            
Running 1m test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   509.11ms  143.87ms   1.57s    80.94%
    Req/Sec   125.48     44.25   330.00     64.29%
  Latency Distribution
     50%  454.96ms
     75%  570.46ms
     90%  744.72ms
     99%  940.77ms
  40000 requests in 1.05m, 15.98MB read
Requests/sec:    634.92
Transfer/sec:    259.80KB
------------------------------
stop time: 39.709957
stop time: 39.780731
stop time: 39.965408
stop time: 40.009045
stop time: 40.240744
stop time: 40.053858
stop time: 40.232231
stop time: 40.398644
[run.sh] Test finished with status 0